Revit 2024 API
LoadBase.LoadCategoryName Property
 The name of the category to which this load belongs.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public string LoadCategoryName { get; }
Visual Basic
Public ReadOnly Property LoadCategoryName As String
	Get
Visual C++
public:
property String^ LoadCategoryName {
	String^ get ();
}
See Also
LoadBase Class
Autodesk.Revit.DB.Structure Namespace